cask_args appdir: '/Applications'

# System utilities
brew 'coreutils'
brew 'findutils'
brew 'grep'
brew 'gnu-sed'
brew 'wget'
brew 'curl'
brew 'htop'
brew 'btop'
brew 'tree'

# Shell and terminal
brew 'zsh'
brew 'tmux'
brew 'fzf'
brew 'bat'
brew 'eza'
brew 'ripgrep'
brew 'fd'
brew 'zoxide'
brew 'atuin'
brew 'the_silver_searcher'
brew 'tpm'

# Development tools
brew 'git'
brew 'tig'
brew 'difftastic'
brew 'colordiff'
brew 'dwdiff'
brew 'wdiff'

# Text editors and IDEs
brew 'neovim'

# Programming languages
brew 'go'
brew 'lua'
brew 'luajit'

# Cloud and DevOps
brew 'awscli'
brew 'aws-vault'
brew 'docker'
brew 'docker-completion'
brew 'docker-compose'

# Terraform ecosystem
brew 'tenv'
brew 'terraform-docs'
brew 'terraform-lsp'
brew 'tflint'
brew 'tfsec'
brew 'tfsort'
brew 'tfupdate'
brew 'tfvar'
brew 'travelgrunt'

# Security tools
brew 'age'
brew 'gnupg'
brew 'pinentry'
brew 'pinentry-mac'
brew 'sops'
brew 'policy_sentry'

# JSON/YAML tools
brew 'jq'

# Code quality and formatting
brew 'shellcheck'
brew 'shfmt'
brew 'clang-format'
brew 'prettier'
brew 'codespell'
brew 'cspell'
brew 'pre-commit'
brew 'commitizen'

# Monitoring and analysis
brew 'iamlive'

# Applications
cask '1password-cli'
cask 'dbeaver-community'
cask 'eloston-chromium'
cask 'font-hack-nerd-font'
cask 'ghostty'
cask 'gpg-suite'
cask 'kdiff3'
